In [8]:
# importing necessary libraries

import pandas as pd

In [9]:
# assigning each dataset to a variable
uber_apr_2014 = pd.read_csv("datasets/uber-raw-data-apr14.csv")
uber_may_2014 = pd.read_csv("datasets/uber-raw-data-may14.csv")
uber_jun_2014 = pd.read_csv("datasets/uber-raw-data-jun14.csv")
uber_jul_2014 = pd.read_csv("datasets/uber-raw-data-jul14.csv")
uber_aug_2014 = pd.read_csv("datasets/uber-raw-data-aug14.csv")
uber_sep_2014 = pd.read_csv("datasets/uber-raw-data-sep14.csv")

In [55]:
# combining uber_apr_to_sep_2014 datasets

combined_dataset = uber_apr_to_sep_2014_dataset = pd.concat([uber_apr_2014, uber_may_2014, uber_jun_2014, uber_jul_2014, uber_aug_2014, uber_sep_2014], ignore_index = True)

In [101]:
# loading the dataframe
combined_dataset

                  Date/Time      Lat      Lon    Base
0       2014-04-01 00:11:00  40.7690 -73.9549  B02512
1       2014-04-01 00:17:00  40.7267 -74.0345  B02512
2       2014-04-01 00:21:00  40.7316 -73.9873  B02512
3       2014-04-01 00:28:00  40.7588 -73.9776  B02512
4       2014-04-01 00:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
4534322 2014-09-30 22:57:00  40.7668 -73.9845  B02764
4534323 2014-09-30 22:57:00  40.6911 -74.1773  B02764
4534324 2014-09-30 22:58:00  40.8519 -73.9319  B02764
4534325 2014-09-30 22:58:00  40.7081 -74.0066  B02764
4534326 2014-09-30 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]

In [102]:
# converting the "Date/Time" column to datetime format
# and renaming the column to "Date_Time"

uber_apr_to_sep_2014_dataset['Date/Time'] = pd.to_datetime(uber_apr_to_sep_2014_dataset['Date/Time'])
renamed_df = uber_apr_to_sep_2014_dataset.rename(columns = {"Date/Time" : "Date_Time"})

In [108]:
# loading the dataframe
renamed_df

                  Date_Time      Lat      Lon    Base
0       2014-04-01 00:11:00  40.7690 -73.9549  B02512
1       2014-04-01 00:17:00  40.7267 -74.0345  B02512
2       2014-04-01 00:21:00  40.7316 -73.9873  B02512
3       2014-04-01 00:28:00  40.7588 -73.9776  B02512
4       2014-04-01 00:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
4534322 2014-09-30 22:57:00  40.7668 -73.9845  B02764
4534323 2014-09-30 22:57:00  40.6911 -74.1773  B02764
4534324 2014-09-30 22:58:00  40.8519 -73.9319  B02764
4534325 2014-09-30 22:58:00  40.7081 -74.0066  B02764
4534326 2014-09-30 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]

In [109]:
# checking for missing values
uber_apr_to_sep_2014_dataset.isnull().sum()

Date/Time    0
Lat          0
Lon          0
Base         0
dtype: int64

In [110]:
# checking how the data is distributed
uber_apr_to_sep_2014_dataset.describe()

                Lat           Lon
count  4.534327e+06  4.534327e+06
mean   4.073926e+01 -7.397302e+01
std    3.994991e-02  5.726670e-02
min    3.965690e+01 -7.492900e+01
25%    4.072110e+01 -7.399650e+01
50%    4.074220e+01 -7.398340e+01
75%    4.076100e+01 -7.396530e+01
max    4.211660e+01 -7.206660e+01

In [111]:
# checking the data type of each colmn in the dataframe
uber_apr_to_sep_2014_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4534327 entries, 0 to 4534326
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   Date/Time  datetime64[ns]
 1   Lat        float64
 2   Lon        float64
 3   Base       object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 138.4+ MB

In [116]:
# Adding usuful colomns

renamed_df['Month'] = renamed_df['Date_Time'].dt.month_name()
renamed_df['Weekday'] = renamed_df['Date_Time'].dt.day_name()
renamed_df['Day'] = renamed_df['Date_Time'].dt.day
renamed_df['Hour'] = renamed_df['Date_Time'].dt.hour
renamed_df['Minute'] = renamed_df['Date_Time'].dt.minute

In [117]:
# loading the dataframe
renamed_df

,Date_Time,Lat,Lon,Base,Month,Weekday,Day,Hour,Minute
0,2014-04-01 00:11:00,40.7690,-73.9549,B02512,April,Tuesday,1,0,11
1,2014-04-01 00:17:00,40.7267,-74.0345,B02512,April,Tuesday,1,0,17
2,2014-04-01 00:21:00,40.7316,-73.9873,B02512,April,Tuesday,1,0,21
3,2014-04-01 00:28:00,40.7588,-73.9776,B02512,April,Tuesday,1,0,28
4,2014-04-01 00:33:00,40.7594,-73.9722,B02512,April,Tuesday,1,0,33
...,...,...,...,...,...,...,...,...,...
4534322,2014-09-30 22:57:00,40.7668,-73.9845,B02764,September,Tuesday,30,22,57
4534323,2014-09-30 22:57:00,40.6911,-74.1773,B02764,September,Tuesday,30,22,57
4534324,2014-09-30 22:58:00,40.8519,-73.9319,B02764,September,Tuesday,30,22,58
4534325,2014-09-30 22:58:00,40.7081,-74.0066,B02764,September,Tuesday,30,22,58
4534326,2014-09-30 22:58:00,40.7140,-73.9496,B02764,September,Tuesday,30,22,58